src/DataProcessors/МенеджерРолиOneScript.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>МенеджерРолиOneScript</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СвойстваКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>СвойстваКомпьютеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКомпьютеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/МенеджерРолиOneScript/Ext/ObjectModule.bsl
// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер) Экспорт 

	Попытка
		
		Результат = УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, "oscript -v > out & set /p ver= < out & del out & echo temp:%ver%
			|oscript -v > out & set /p ver= < out & del out & echo oscriptversion:%ver%");
		Если Результат.КодВозврата = 0 Тогда
			Версия = УдаленноеУправление.ПолучитьЗначениеИзЛога(Результат.Лог, "oscriptversion");
			Если ПустаяСтрока(Версия) Тогда
				Результат.КодВозврата = 1;
			КонецЕсли;
			РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "OneScript", ?(ПустаяСтрока(Версия), 0, 1));
			РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "OneScript.Version", Версия);
		КонецЕсли;
		
		Возврат Результат.КодВозврата = 0;
		
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
